backend/traits/EnforceProjectContextTrait.php

SELECT * FROM `project` WHERE `id`='1'
---
    public function loadProject($project_id)
    {
        if (($model = Project::findOne($project_id)) !== null) {