backend/controllers/TaskController.php

    public function actionCreate($project_id, $submit = false)
    {
        $this->loadProject($project_id);
        $model = new Task();
        $model->project_id = $project_id;

        if (Yii::$app->request->isAjax && $model->load(Yii::$app->request->post()) && $submit == false) {
            Yii::$app->response->format = Response::FORMAT_JSON;
            return ActiveForm::validate($model);
        }

        if ($model->load(Yii::$app->request->post())) {
            if ($model->save()) {
---
INSERT INTO `task` (`project_id`, `name`, `description`, `status_id`, `owner_id`, `requester_id`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES (1, 'C VDGVFG', 'REWDED', 1, 1, 2, NOW(), NOW(), 1, 1)

    protected function findModel($id)
    {
        if (($model = Task::findOne($id)) !== null) {
---
SELECT * FROM `task` WHERE `id`='7'