backend/models/Task.php

SELECT * FROM `status`
---
    public function getStatusesList()
    {
        $statuses = Status::find()->all();